###################################################################

# Created by write_sdc on Fri Feb 19 17:40:58 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA_IN[0]}]
set_load -pin_load 3.40189 [get_ports DRAM_EN]
set_load -pin_load 3.40189 [get_ports MEM_READ_WRITE_N]
create_clock [get_ports CLK]  -period 1.7  -waveform {0 0.85}
set_clock_uncertainty 0.07  [get_clocks CLK]
set_input_delay -clock CLK  -max 0.5  [get_ports RST_n]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[31]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[30]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[29]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[28]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[27]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[26]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[25]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[24]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[23]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[22]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[21]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[20]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[19]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[18]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[17]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[16]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_DATA[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[31]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[30]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[29]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[28]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[27]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[26]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[25]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[24]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[23]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[22]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[21]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[20]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[19]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[18]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[17]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[16]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_OUT[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[31]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[30]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[29]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[28]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[27]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[26]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[25]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[24]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[23]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[22]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[21]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[20]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[19]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[18]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[17]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[16]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[15]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[14]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDRESS[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[31]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[30]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[29]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[28]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[27]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[26]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[25]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[24]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[23]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[22]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[21]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[20]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[19]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[18]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[17]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[16]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[15]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[14]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDRESS[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[31]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[30]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[29]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[28]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[27]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[26]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[25]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[24]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[23]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[22]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[21]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[20]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[19]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[18]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[17]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[16]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[15]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[14]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_DATA_IN[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports DRAM_EN]
set_output_delay -clock CLK  -max 0.5  [get_ports MEM_READ_WRITE_N]
